try:
    x1 = int(input("Введите X-координату 1-го поля (1-8): "))
    y1 = int(input("Введите Y-координату 1-го поля (1-8): "))
    x2 = int(input("Введите X-координату 2-го поля (1-8): "))
    y2 = int(input("Введите Y-координату 2-го поля (1-8): "))

    while (x1 < 1 or x1 > 8) or (y1 < 1 or y1 > 8) or (x2 < 1 or x2 > 8) or (y2 < 1 or y2 > 8):
        print("Одна или несколько координат находятся вне диапазона!")
        x1 = int(input("Введите X-координату 1-го поля (1-8): "))
        y1 = int(input("Введите Y-координату 1-го поля (1-8): "))
        x2 = int(input("Введите X-координату 2-го поля (1-8): "))
        y2 = int(input("Введите Y-координату 2-го поля (1-8): "))

    print(((x1 + y1) % 2 == 0 and (x2 + y2) % 2 == 0) or ((x1 + y2) % 2 == 1 and (x2 + y1) % 2 == 1))
except ValueError:
    print("Ошибка типа данных")