m = int(input("Введите номер месяца 1-12: "))

if m == 1:
    print("Январь: ", 31, "день")
elif m == 2:
    print("Февраль: ", 28, "дней")
elif m == 3:
    print("Март: ", 31, "день")
elif m == 4:
    print("Апрель: ", 30, "дней")
elif m == 5:
    print("Май: ", 31, "день")
elif m == 6:
    print("Июнь: ", 30, "дней")
elif m == 7:
    print("Июль: ", 31, "день")
elif m == 8:
    print("Август: ", 31, "день")
elif m == 9:
    print("Сентябрь: ", 30, "дней")
elif m == 10:
    print("Октябрь: ", 31, "день")
elif m == 11:
    print("Ноябрь: ", 30, "дней")
elif m == 12:
    print("Декабрь: ", 31, "день")