#Дан символ C, изображающий цифру или букву (латинскую или русскую). Если C
#изображает цифру, то вывести строку «digit», если латинскую букву — вывести
# «lat», если русскую — вывести строку «rus».

c = input("Введите символ (цифру, букву): ")

digit = ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]
rus_letter = ["а", "б", "в", "г", "д", "е", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я"]
lat_letter = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z"]

if c in rus_letter:
    print("rus")
elif c in lat_letter:
    print("lat")
elif c in digit:
    print("digit")