#Дана строка-предложение на русском языке. Зашифровать ее, выполнив
#циклическую замену каждой буквы на следующую за ней в алфавите и сохранив при
#этом регистр букв («А» перейдет в «Б», «а» — в «б», «Б» — в «В», «я» — в «а» и т.
#д.). Букву «ё» в алфавите не учитывать («е» должна переходить в «ж»). Знаки
#препинания и пробелы не изменять.

subject = str(input("Введите предложение на русском языке: "))

rus_lower = ["а", "б", "в", "г", "д", "е", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я"]
rus_upper = ["А", "Б", "В", "Г", "Д", "Е", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "Р", "С", "Т", "У", "Ф", "Х", "Ц", "Ч", "Ш", "Щ", "Ъ", "Ы", "Ь", "Э", "Ю", "Я"]

result = ""

for letter in subject:
    if letter in rus_lower:
        i = rus_lower.index(letter)
        result += rus_lower[(i + 1) % len(rus_lower)]
    elif letter in rus_upper:
        i = rus_upper.index(letter)
        result += rus_upper[(i + 1) % len(rus_upper)]
    else:
        result += letter

print(result)